---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IntersectionResultArray
source: html/8a6406c3-ead0-61f2-6539-535dddf9affc.htm
---
# IntersectionResultArray Members

Initializes a new instance of the IntersectionResultArray class